// export const REGULAR_LIST = [{
//     name: '', // 正则名称
//     regVal: '', // 正则表达式
//     regText: '', // 正则显示的值
//     desc: '', // 正则描述
// }];


export const REGULAR_LIST = [{
    name: '中文标点符号',
    rule: /[\u3002|\uff1f|\uff01|\uff0c|\u3001|\uff1b|\uff1a|\u201c|\u201d|\u2018|\u2019|\uff08|\uff09|\u300a|\u300b|\u3008|\u3009|\u3010|\u3011|\u300e|\u300f|\u300c|\u300d|\ufe43|\ufe44|\u3014|\u3015|\u2026|\u2014|\uff5e|\ufe4f|\uffe5]/,
    example: 'sz000858、SZ002136、sz300675、SH600600、sh601155',
    desc: '匹配中文标点: ，  。 ？ ！ ， 、 ； ： “ ” ‘ \' （ ） 《 》 〈 〉 【 】 『 』 「 」 ﹃ ﹄ 〔 〕 … — ～ ﹏ ￥',
}, {
    name: '手机号(严谨)',
    rule: /^1((3[\d])|(4[5,6,7,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[1,8,9]))\d{8}$/,
    example: '如: 18311006933、17888829981',
    desc: '根据工信部2019年最新公布的手机号段',
}, {
    name: '手机号(宽松)',
    rule: /^1[3-9]\d{9}$/,
    example: '如: 18311006933、17888829981',
    desc: '只要是13,14,15,16,17,18,19开头即可',
}, {
    name: '电话(座机)',
    rule: /^0\d{2,3}-\d{7,8}$/,
    example: '如: 0936-4211236',
    desc: '',
}, {
    name: '纯数字',
    rule: /^\d{1,}$/,
    example: '如: 12345678',
    desc: '',
}, {
    name: '是否小数',
    rule: /^\d+\.\d+$/,
    example: '如: 0.0、0.09',
    desc: '',
}, {
    name: '匹配正整数',
    rule: /^[1-9]\d*$/,
    example: '',
    desc: '',
}, {
    name: '匹配负整数',
    rule: /^-[1-9]\d*$/,
    example: '',
    desc: '',
}, {
    name: '匹配整数',
    rule: /^-?[1-9]\d*$/,
    example: '',
    desc: '',
}, {
    name: '匹配非负整数（正整数 + 0）',
    rule: /^[1-9]\d*|0$/,
    example: '',
    desc: '',
}, {
    name: '匹配非正整数（负整数 + 0）',
    rule: /^-[1-9]\d*|0$/,
    example: '',
    desc: '',
}, {
    name: '匹配正浮点数',
    rule: /^[1-9]\d*.\d*|0.\d*[1-9]\d*$/,
    example: '',
    desc: '',
}, {
    name: '匹配负浮点数',
    rule: /^-([1-9]\d*.\d*|0.\d*[1-9]\d*)$/,
    example: '',
    desc: '',
} ,{
    name: '匹配浮点数',
    rule: /^-?([1-9]\d*.\d*|0.\d*[1-9]\d*|0?.0+|0)$/,
    example: '',
    desc: '',
}, {
    name: '匹配非负浮点数（正浮点数 + 0）',
    rule: /^[1-9]\d*.\d*|0.\d*[1-9]\d*|0?.0+|0$/,
    example: '',
    desc: '',
}, {
    name: '匹配非正浮点数（负浮点数 + 0）',
    rule: /^(-([1-9]\d*.\d*|0.\d*[1-9]\d*))|0?.0+|0$/,
    example: '',
    desc: '',
}, {
    name: '分数判断',
    rule: /^150$|(^\d|^[1-9]\d|^[1][0-4]\d)(\.5)?$/,
    example: '如: 150, 100.5',
    desc: '大于0, 小于150, 支持小数位出现5, 如145.5, 用于判断考卷分数',
}, {
    name: 'html注释',
    rule: /<!--(.*?)-->$/,
    example: '如: \x3c!--<div class="_bubble"></div>--\x3e',
    desc: '',
}, {
    name: 'md5格式(32位)',
    rule: /^[a-f0-9]{32}$/,
    example: '如: 21fe181c5bfc16306a6828c1f7b762e8',
    desc: '',
}, {
    name: '版本号格式必须为X.Y.Z',
    rule: /^\d+(\.\d+){2}$/,
    example: '如: 16.3.10',
    desc: '版本号是否为语义化版本控制规范',
}, {
    name: '视频链接地址（视频格式可按需增删）',
    rule: /^https?:\/\/.*?(swf|avi|flv|mpg|rm|mov|wav|asf|3gp|mkv|rmvb|mp4)$/i,
    example: '如: http://www.abc.com/video/wc.avi',
    desc: '',
}, {
    name: '图片链接地址（图片格式可按需增删）',
    rule: /^https?:\/\/.*?(gif|png|jpg|jpeg|webp|svg|psd|bmp|tif)$/i,
    example: '如: https://www.abc.com/logo.png',
    desc: '',
}, {
    name: '24小时制时间（HH:mm:ss）',
    rule: /^((?:[01]\d|2[0-3]):[0-5]\d:[0-5]\d$)/,
    example: '如: 23:34:55',
    desc: '',
}, {
    name: '12小时制时间（hh:mm:ss）',
    rule: /^(1[0-2]|0?[1-9]):[0-5]\d:[0-5]\d$/,
    example: '如: 11:34:55合法、23:34:55不合法',
    desc: '',
}, {
    name: 'base64格式',
    rule: /^\s*data:([a-z]+\/[a-z0-9-+.]+(;[a-z-]+=[a-z0-9-]+)?)?(;base64)?,([a-z0-9!$&',()*+;=\-._~:@\\/?%\s]*?)\s*$/i,
    example: '如: data:image/gif;base64,xxxx==',
    desc: '',
}, {
    name: '数字/货币金额（支持负数、千分位分隔符）',
    rule: /(^[-]?[1-9]\d{0,2}($|(,\d{3})*($|(\.\d{1,2}$))))|((^[0](\.\d{1,2})?)|(^[-][0]\.\d{1,2}))$/,
    example: '如: 100、-0.99、3,234.32、-1,900,235.09',
    desc: '',
}, {
    name: '数字/货币金额 (只支持正数、不支持校验千分位分隔符)',
    rule: /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/,
    example: '如: 0.99、8.99、666',
    desc: '',
}, {
    name: '银行卡号（16或19位）',
    rule: /^([1-9]{1})(\d{15}|\d{18})$/,
    example: '如: 6222026006705354217',
    desc: '',
}, {
    name: '中文姓名',
    rule: /^([\u4e00-\u9fa5·]{2,16})$/,
    example: '如: 葛二蛋、凯文·杜兰特、德克·维尔纳·诺维茨基',
    desc: '',
}, {
    name: '英文姓名',
    rule: /(^[a-zA-Z]{1}[a-zA-Z\s]{0,20}[a-zA-Z]{1}$)/,
    example: '如: James、Kevin Wayne Durant、Dirk Nowitzki',
    desc: '',
}, {
    name: '新能源车牌号',
    rule: /[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF][A-HJ-NP-Z0-9][0-9]{4}))$/,
    example: '如: 京AD92035(小型)、甘G23459F(大型)',
    desc: '',
}, {
    name: '非新能源车牌号',
    rule: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,
    example: '如: 京A00599、黑D23908',
    desc: '',
}, {
    name: '车牌号(新能源+非新能源)',
    rule: /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9 挂学警港澳]{1})$/,
    example: '如: 京A12345D、京A00599',
    desc: '',
}, {
    name: 'URL链接(网址)',
    rule: /^((https?|ftp|file):\/\/)?([\da-z.-]+)\.([a-z.]{2,6})(\/\w\.-]*)*\/?/,
    example: '如: www.qq.com 、file:///C:/Users/KD/index.js',
    desc: '',
}, {
    name: '日期, 如: 2000-01-01或2000-1-1',
    rule: /^\d{4}(-)([0-1][0-2]|\d)\1([0-2]\d|\d|30|31)$/,
    example: '如: 1990-12-12、2020-01-01',
    desc: '',
}, {
    name: 'email地址',
    rule: /^[a-zA-Z0-9.!#$%&'*+\\/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/,
    example: '如: 90203918@qq.com、nbilly@126.com',
    desc: '',
}, {
    name: '国内座机电话,如: 0341-86091234',
    rule: /\d{3}-\d{8}|\d{4}-\d{7}/,
    example: '如: 0936-4211235',
    desc: '',
}, {
    name: '身份证号',
    rule: /(^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$)|(^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$)/,
    example: '如: 622223199912051311',
    desc: '支持1/2代(15位/18位数字)',
}, {
    name: '一代身份证号(15位数字)',
    rule: /^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$/,
    example: '如: 622001790131123',
    desc: '',
}, {
    name: '二代身份证号',
    rule: /^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$/,
    example: '如: 62222319991205131x',
    desc: '18位数字,最后一位是校验位,可能为数字或字符X',
}, {
    name: '护照（包含香港、澳门）',
    rule: /(^[EeKkGgDdSsPpHh]\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\d{7}$)/,
    example: '如: s28233515、141234567、159203084、MA1234567、K25345719',
    desc: '',
}, {
    name: '帐号是否合法',
    rule: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/,
    example: '如: justin、justin1989、justin_666',
    desc: '字母开头，允许5-16字节，允许字母数字下划线组合',
}, {
    name: '是否html标签',
    rule: /<(.*)>.*<\/\1>|<(.*) \/>/,
    example: '如: <div> </div>',
    desc: '',
}, {
    name: '是否qq号格式正确',
    rule: /^[1-9][0-9]{4,10}$/,
    example: '如: 903013545、9020304',
    desc: '',
}, {
    name: '是否由数字和字母组成',
    rule: /^[A-Za-z0-9]+$/,
    example: '如: james666、haha233hi',
    desc: '',
}, {
    name: '纯中文/汉字',
    rule: /^[\u4E00-\u9FA5]+$/,
    example: '如: 正则、前端',
    desc: '',
}, {
    name: '纯英文字母',
    rule: /^[a-zA-Z]+$/,
    example: '如: russel',
    desc: '',
}, {
    name: '纯小写英文字母组成',
    rule: /^[a-z]+$/,
    example: '如: russel',
    desc: '',
}, {
    name: '纯大写英文字母',
    rule: /^[A-Z]+$/,
    example: '如: ABC、KD',
    desc: '',
}, {
    name: '密码强度正则',
    rule: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
    example: '如: Kd@curry666',
    desc: '最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符',
}, {
    name: '用户名正则',
    rule: /^[a-zA-Z0-9_-]{4,16}$/,
    example: '如: xiaohua_qq',
    desc: '4到16位（字母，数字，下划线，减号）',
}, {
    name: 'ip-v4',
    rule: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,
    example: '如: 172.16.0.0、127.0.0.0',
    desc: '',
}, {
    name: 'ip-v6',
    rule: /^((([0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))$/i,
    example: '如: 2031:0000:130f:0000:0000:09c0:876a:130b',
    desc: '',
}, {
    name: '16进制颜色',
    rule: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/,
    example: '如: #f00 、#F90、#000、 #fe9de8',
    desc: '',
}, {
    name: '微信号',
    rule: /^[a-zA-Z][-_a-zA-Z0-9]{5,19}$/,
    example: '如: github666、kd_-666',
    desc: '6至20位，以字母开头，字母，数字，减号，下划线',
}, {
    name: '中国邮政编码',
    rule: /^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/,
    example: '如: 734500、100101',
    desc: '',
}, {
    name: '只包含中文和数字',
    rule: /^(([\u4E00-\u9FA5])|(\d))+$/,
    example: '如: 哈哈哈、你好6啊',
    desc: '',
}, {
    name: '不能包含字母',
    rule: /^[^A-Za-z]*$/,
    example: '如: 你好6啊、@¥()！',
    desc: '',
}, {
    name: 'A股代码',
    rule: /^(s[hz]|S[HZ])(000[\d]{3}|002[\d]{3}|300[\d]{3}|600[\d]{3}|60[\d]{4})$/,
    example: 'sz000858、SZ002136、sz300675、SH600600、sh601155',
    desc: '',
}, {
    name: '空白行',
    rule: /\n\s*\r/,
    example: '',
    desc: '可以用来删除空白行',
}, {
    name: '首尾空白字符',
    rule: /^\s*|\s*$/,
    example: '',
    desc: '可以用来删除行首行尾的空白字符(包括空格、制表符、换页符等等)',
}, {
    name: '邮箱（Email）',
    rule: /\w+([-+.]\w+)@\w+([-.]\w+).\w+([-.]\w+)*/,
    example: '',
    desc: '校验是否为合法邮箱地址，表单校验有用',
}];
